#ifndef __INIT_H__
#define __INIT_H__

/*******************************回路IO口定义************************************************/
#define LOOP_FIVE_CTR       GPIOE//GPIOC//回路7.5V控制器引脚
#define LOOP_FIVE_PIN       GPIO_Pin_2//GPIO_Pin_7

#define LOOP_SHORT_CRT     GPIOE //回路短路检测引脚,过流
#define LOOP_SHORT_PIN     GPIO_Pin_1

#define LOOP_SHORT_V_CRT  GPIOE //回路短路过压检测
#define LOOP_SHORT_V_PIN  GPIO_Pin_0

#define LOOP_HIGH_CTR      GPIOE //回路18V控制引脚
#define LOOP_HIGH_PIN      GPIO_Pin_3//GPIO_Pin_2

#define LOOP_ANS_CTR      GPIOB //回路回码引脚
#define LOOP_ANS_PIN      GPIO_Pin_7 //GPIO_Pin_10

#define LOOP_ZERO_CTR     GPIOE //回路0V控制引脚
#define LOOP_ZERO_PIN     GPIO_Pin_4//GPIO_Pin_5

#define LOOP_PWR_CTR      GPIOD
#define LOOP_PWR_PIN      GPIO_Pin_6 //GPIO_Pin_12

/*******************************************************************************
 函 数 名：	STM32_CONFIG
 功能描述：	初始化stm32
 入口参数：	无
 出口参数：	无
 返回值	   ：无
********************************************************************************/
void STM32_CONFIG(void);

/*******************************************************************************
 函 数 名：	delay_1us
 功能描述：	延时1us
 入口参数：	无
 出口参数：	无
 返回值	    ：无
********************************************************************************/
void delay_1us(void);

/*******************************************************************************
 函 数 名：	delay_nus
 功能描述：	延时nus
 入口参数：	t 延时us数
 出口参数：	无
  返回值	    ：无
********************************************************************************/
void delay_nus(u16 t);

/*******************************************************************************
 函 数 名：	delay_1ms
 功能描述：	延时1ms
 入口参数：	无
 出口参数：	无
  返回值	    ：无
********************************************************************************/
void delay_1ms(void);

/*******************************************************************************
  函 数 名：	delay_nms
  功能描述：	延时nms
  入口参数：	n:ms数
  出口参数：	无
  返回值	    ：无
********************************************************************************/
void delay_nms(u16 n);

/**************************************************************************
函数原型：feed_dog
功能描述：喂狗
入口参数：无
出口参数：无
返回值	  ：无
**************************************************************************/
void feed_dog(void);

void LOOP_CONFIG(void);

#endif
