#ifndef __LOOP_HW_H__
#define __LOOP_HW_H__

#include "stm32f10x.h"
#include "def.h"
/*
 #
 #	LOOP1回码TIM3_CH2
 #	LOOP2回码TIM2_CH2
 #	TIM1用于回路发码和回码超时
 #	
 */

#define CHANNEL_1		0
#define CHANNEL_2		1

#define	STATE_IDLE		0		//空闲
#define	STATE_SEND		1		//发送
#define	STATE_RECEIVE	2		//接收
#define	STATE_REC_IEV1	3		//接收间隔
#define	STATE_REC_IEV2	4		//接收间隔
#define	STATE_END		5		//接收完成
#define STATE_SHORT		6		//短路

#define TIME_50US		50
#define TIME_250US		250
#define TIME_334US		360		//334
#define TIME_668US		750		//668
#define TIME_800US		800
#define TIME_2P5MS		3000	//2500

#define TIME_1758US 	1758 
#define TIME_150US		150
#define TIME_300US		300
#define TIME_600US		600
#define TIME_900US		900
#define TIME_1200US		1200
#define TIME_1500US		1500

#define TIME_INVALID	70

//#define LED_ON()		GPIOB->BRR = 1 << 0
//#define LED_OFF()		GPIOB->BSRR = 1 << 0

typedef struct __loop_hw {
	u8		channel;		//回路号
	u8		state;			//回路状态
	u8		addr;			//地址
	u8		cmd;			//控制位
	u8		len;			//期望接收长度
	BOOL	sht[2];			//短路状态
	u8		send_cnt;		//发送计数
	u8		rec_cnt;		//接收计数
	u8		edge;			//接收回码边沿0:下降沿1:上升沿
	u32		pw[5];			//回路数据
	void (*short_callback)(u8 channel);
} loop_hw;

/**************************************************************************
 函 数 名    ：loop_send
 功能描述：回路发0V
 入口参数：channel->回路号
 出口参数：无
 返回值      ：无
**************************************************************************/
void loop_send_0V(u8 channel);

/**************************************************************************
 函 数 名    ：loop_send_24V
 功能描述：回路发24V
 入口参数：channel->回路号
 出口参数：无
 返回值      ：无
**************************************************************************/
void loop_send_24V(u8 channel);

/**************************************************************************
 函 数 名    ：loop_clear_24V
 功能描述：回路取消发24V
 入口参数：channel->回路号
 出口参数：无
 返回值      ：无
**************************************************************************/
void loop_clear_24V(u8 channel);

/**************************************************************************
 函 数 名    ：loop_power_enable
 功能描述：回路输出电源使能
 入口参数：channel->回路号
 出口参数：无
 返回值      ：无
**************************************************************************/
void loop_power_enable(u8 channel);

/**************************************************************************
 函 数 名    ：loop_power_disable
 功能描述：回路输出电源不使能
 入口参数：channel->回路号
 出口参数：无
 返回值      ：无
**************************************************************************/
void loop_power_disable(u8 channel);

/**************************************************************************
 函 数 名    ：loop_power_on
 功能描述：回路上电
 入口参数：channel->回路号
 出口参数：无
 返回值      ：无
**************************************************************************/
void loop_power_on(u8 channel);

/**************************************************************************
 函 数 名    ：loop_send
 功能描述：回路发码
 入口参数：channel->回路号 addr->设备地址cmd->控制命令	
 出口参数：无
 返回值      ：无
**************************************************************************/
void loop_send(u8 channel, u8 addr, u8 cmd, u8 rec_len);

/**************************************************************************
 函 数 名    ：loop_answer
 功能描述：取回回码数据
 入口参数：无	
 出口参数：回码数据
 返回值      ：回码长度
**************************************************************************/
u8 loop_answer(u32 pw[5]);

/**************************************************************************
 函 数 名    ：allow_loop_send
 功能描述：允许回路发送
 入口参数：无	
 出口参数：无
 返回值      ：TURE->可以发送FALSE->禁止发送
**************************************************************************/
BOOL allow_loop_send(void);

/**************************************************************************
 函 数 名    ：allow_loop_receive
 功能描述：允许回路接收
 入口参数：无	
 出口参数：无
 返回值      ：TURE->可以接收FALSE->禁止接收
**************************************************************************/
BOOL allow_loop_receive(void);

/**************************************************************************
 函 数 名    ：register_loop_short_callback
 功能描述：注册回路过载回调函数
 入口参数：channel->回路号call_back->过载处理函数
 出口参数：无
 返回值      ：无
**************************************************************************/
void register_loop_short_callback(void (*call_back)(u8 channel));

void loop_send_5V(u8 channel);
extern uint8_t loop_short_flag;


#endif

