/*
********************************************************************************
*                             北京国泰怡安电子有限公司
* 地    址 ： 北京市丰台区杜家坎南路8号
* 邮    编 ： 100072
* 网    址 ： Http://www.guotaiyian.com
*
* 文 件 名 :  LoopOpt.h
* 编    制 :  白 瑜
* 创建时间 :  2006/09/06
* 描    述 :
********************************************************************************
*/
#ifndef _LOOPOPT_H_
#define _LOOPOPT_H_
/******************************************************************************/
#include "LoopDataStruct.h"
#include "loop.h"
#include "LoopCfg.h"

//电平控制宏定义

#define Len200ms    65000    // 如果系统有两个回路则一个回路扫完后送一个长期的24V
#define Len10ms     10000    // 一个回路两次扫描的最短间隔
#define Len5ms	    5000     // 发5V等待回码的超时限制
#define Len3ms	    3000     // 发5V等待回码的超时限制
#define Len2ms	    2000     // 发5V等待回码的超时限制
#define Len668us    668      // 起始码的长度
#define Len334us    334      // 24V和发码过程中的0V,5V的长度

/******************************************************************************/
extern  LOOPS LOOP[ 2 ];   // 定义回路结构型回路变量。
extern LOOPDevice ALLDevices[2][256]; // 每个回路上256个回路器件型结构空间
extern u8  OptingLoopNO;      // 当前正在操作的回路号0，1
extern u32 CheckTypeTimeTicks;   // 回路定期做器件类型检查，此变量是用于这个事情的时间计数器
extern u8  LDList[2][256];// 器件联动表

extern BOOL AutoRegister_flag;      // 自动登陆时置位，登陆完成清0
extern BOOL LoopCanScan_flag;       // 控制回路是否可以扫描

/*
********************************************************************************
* 函数名称: void LoopCfgInit(u8 InitType);
* 函数功能: 回路配置初始化
* 参    数: u8 InitType :  INIT_STATE 初始化状态区
*                             KEEP_STATE 不初始化状态区
* 返 回 值: 无
* 注    意: 本函数为静态的，只供本文件中调用
********************************************************************************
*/
#define LOOP_CFGED_INIT_STATE  0 //回路重新配置时初始化状态区
#define LOOP_CFGED_KEEP_STATE  1 //回路重新配置时不初始化状态区
void LoopCfgInit(u8 InitType);

/*
********************************************************************************
* 函数名称: void LoopListInit( u8 LN );
* 函数功能: 回路链表的初始化，系统接收到主机相关配置或被修改相关配置后调用
* 参    数: u8 LN :回路号 0,1
* 返 回 值: 无
* 注    意:
********************************************************************************
*/
void LoopListInit( u8 LN );

/*
********************************************************************************
* 函数名称: void DevOptInitAndRun(u8 LN);
* 函数功能: 某回路中下一个器件操作之前的过程变量等的初始化和启动操作
* 参    数: u8 LN ：回路号 0,1
* 返 回 值: 无
* 注    意:
********************************************************************************
*/
void DevOptInitAndRun(u8 LN);

/*
********************************************************************************
* 函数名称: BOOL LoopShortChk(u8 LN);
* 函数功能: 负责回路短路后重新启动回路
* 参    数: u8 LN   : 回路号 0,1
* 返 回 值:无
* 注    意: 
********************************************************************************
*/
void LoopShortChk(u8 LN);

/*
********************************************************************************
* 函数名称: void LoopCardISR_Handler( void );
* 函数功能: 回路相关的中断处理
* 注    意: 回路中断在以下情况下发生：
*           1，发码时334us、668us定时到
*           2，收码时5ms超时时间到
*           3，收码时回码的沿正常收到
*|<-起始位->|<--------------器件地址8位------------------->|<------命令字4位------>|<-P->|<--回码PW0~PWn (n<=5)-->..|
*____      __    __    __    __    __    __    __    __    __    __    __    __    __    __    __      __
*    |    |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |  |__|  |____|  |____......
*    |____|  |__|  |__|  |__|  |__|  |__|  |__|  |__|  |__|  |__|  |__|  |__|  |__|  |__|
*       0  1  2  3  4  5  6  7  8  9  10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29
* 上面的数字是回路发码顺序指示
********************************************************************************
*/
void LoopCardTimerISR_Handler( void );  // 定时器中断334us,668us,5ms
void LoopCardCCPISR_Handler( void );    // 回码捕捉

/*
********************************************************************************
* 函数名称:void SetLDList(u8 category, u16 controllerID, u8 loop, u8 address, u8 control_type)
* 函数功能: 设置回路上器件联动表,参数为矩阵输出协议的字节5，6，7。
* 参    数: 输出项的字节5，6，7，字节4无用
* 返 回 值: 无
* 注    意:
********************************************************************************
*/
void SetLDList(u8 category, u16 controllerID, u8 loop, u8 address, u8 control_type);

/*
********************************************************************************
* 函数名称: AutoRegInit
* 函数功能: 回路自动登陆前初始化工作。
* 参    数: ln_no:BIT0 本卡第一回路BIT1 本卡第二回路
* 返 回 值: 无
********************************************************************************
*/
void AutoRegInit(u8 ln_no);

/*
********************************************************************************
* 函数名称: void auto_register_init(u8 channel)
* 函数功能: 回路自动登陆前初始化工作。
* 参    数: channel:回路编号
* 返 回 值: 无
********************************************************************************
*/
//void auto_register_init(u8 channel);


/*
********************************************************************************
* 函数名称: u8  XJCMD(u8 LN, u8 Addr);
* 函数功能: 获取适用于某个回路上某个器件的巡检命令。
* 参    数: u8  LN   : 0,1
*           u8  Addr : 1~255
* 返 回 值: 1个字节的巡检命令。如果报过火警   返回0x0a
*                              没有火警且灭灯 返回0x0d
*                              其它正常情况   返回0x00
********************************************************************************
*/
u8  XJCMD(u8 LN, u8 Addr);

/******************************************************************************/
/******************************************************************************/
/******************************************************************************/
/******************************************************************************/
/******************************************************************************/
/******************************************************************************/
/*
********************************************************************************
* 函数名称: void AnsCodeDeal(u8 LN, u8 device_Addr);
* 函数功能: 回路回码数据处理
* 参    数: u8 LN          : 回路号0 或 (0,1)
*           u8 device_Addr : 器件号1~255
* 返 回 值: 无
* 注    意:
********************************************************************************
*/
void AnsCodeDeal(u8 LN, u8 device_Addr);

/*
********************************************************************************
* 函数名称: void AutoRegFinished();
* 函数功能: 回路自动登陆完成后，重新初始化扫描链表，数据上传。
* 参    数: 无
* 返 回 值: 无
* 注    意:
********************************************************************************
*/
void AutoRegFinished(void);

/******************************************************************************/
#endif






